#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repository.github_branch.template_files[0] will be created
  + resource "github_branch" "template_files" {
      + branch        = "template_files"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "testing-template-repository-jkshdbjk"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "testing-template-repository-jkshdbjk"
    }

  # module.repository.github_branch_protection_v3.main[0] will be created
  + resource "github_branch_protection_v3" "main" {
      + branch                          = "main"
      + enforce_admins                  = true
      + etag                            = (known after apply)
      + id                              = (known after apply)
      + repository                      = "testing-template-repository-jkshdbjk"
      + require_conversation_resolution = true
      + require_signed_commits          = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_teams                 = [
              + "@flufi-io/devops-engineers",
            ]
          + dismissal_users                 = [
              + "pipo-flufi",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "terratest",
            ]
          + strict   = true
        }

      + restrictions {
          + teams = [
              + "@flufi-io/devops-engineers",
            ]
          + users = [
              + "pipo-flufi",
            ]
        }
    }

  # module.repository.github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "testing template repository"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "testing-template-repository-jkshdbjk"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.repository.github_repository_file.template_files["../../.config/.terraform-docs.yml"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            formatter: markdown table
            
            version: ""
            
            header-from: main.tf
            footer-from: ""
            
            recursive:
              enabled: false
              path: modules
            
            sections:
              show:
                - header
                - inputs
                - providers
                - modules
                - outputs
            
            #content: ""
            content: |-
              # Examples
              ```hcl
              {{ include "examples/complete/README.md" }}
              ```
              {{ .Header }}
              {{ .Providers }}
              {{ .Inputs }}
              {{ .Outputs }}
              ## Resources
              {{ range .Module.Resources }}
              - {{ .GetMode }}.{{ .Spec }} ({{ .Position.Filename }}#{{ .Position.Line }})
              {{- end }}
            
            output:
              file: README.md
              mode: inject
              template: |-
                <!-- BEGIN_TF_DOCS -->
                {{ .Content }}
                <!-- END_TF_DOCS -->
            
            
            sort:
              enabled: true
              by: name
            
            settings:
              anchor: true
              color: true
              default: true
              description: false
              escape: true
              hide-empty: true
              html: true
              indent: 2
              lockfile: true
              read-comments: true
              required: true
              sensitive: true
              type: true
        EOT
      + file                = ".config/.terraform-docs.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../.github/workflows/terrascan.yml"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: terrascan
            on: [ push ]
            
            jobs:
              terrascan:
                runs-on: ubuntu-latest
                name: terrascan-action
                steps:
                  - name: Checkout repository
                    uses: actions/checkout@v3
                    with:
                      ref: ${{ github.event.pull_request.head.ref }}
                  - name: Run Terrascan
                    id: terrascan
                    uses: tenable/terrascan-action@main
                    with:
                      iac_type: 'terraform'
                      iac_version: 'v14'
                      policy_type: 'aws,github'
                      only_warn: true
                      sarif_upload: true
                      non_recursive: true
                      #iac_dir:
                      #policy_path:
                      #skip_rules:
                      #config_path:
                  - name: Upload SARIF file
                    uses: github/codeql-action/upload-sarif@v2
                    with:
                      sarif_file: terrascan.sarif
        EOT
      + file                = ".github/workflows/terrascan.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../.github/workflows/tfsec.yml"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: tfsec
            on:
              pull_request:
            jobs:
              tfsec:
                name: tfsec-pr-commenter
                runs-on: ubuntu-latest
                steps:
                  - name: clone repo
                    uses: actions/checkout@master
                  - name: tfsec
                    uses: aquasecurity/tfsec-pr-commenter-action@v1.2.0
                    with:
                      github_token: ${{ github.token }}
        EOT
      + file                = ".github/workflows/tfsec.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../.gitignore"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            .idea
            .vscode
            **/*.tfstate*
            *.tfstate*
            **/.terraform
            .terraform
            **/.terraform.lock.hcl
            .terraform.lock.hcl
            !**/.terraform-docs.yml
            !.terraform-docs.yml
            **/go.*
            go.*
            secrets.json
            **/variables.yml
            variables.yml
            !examples/complete/variables.yml
            secrets.yml
            **/secrets.json
            **/secrets.yml
            workspaces/*.yml
            !workspaces/*.enc.yml
            .env
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../README.md"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # terraform-module-template
            <!-- BEGIN_TF_DOCS -->
            # Examples
            ```hcl
            # terraform-module-template
            ```
            
            ## Providers
            
            | Name | Version |
            |------|---------|
            | <a name="provider_github"></a> [github](#provider\_github) | 4.25.0 |
            ## Inputs
            
            | Name | Description | Type | Default | Required |
            |------|-------------|------|---------|:--------:|
            | <a name="input_description"></a> [description](#input\_description) | Description of the repository | `string` | n/a | yes |
            | <a name="input_enable_branch_protection"></a> [enable\_branch\_protection](#input\_enable\_branch\_protection) | Enable the branch protection for the default(main) branch | `bool` | `true` | no |
            | <a name="input_name"></a> [name](#input\_name) | Name of the repository | `string` | n/a | yes |
            | <a name="input_required_pull_request_reviews"></a> [required\_pull\_request\_reviews](#input\_required\_pull\_request\_reviews) | Branch protection options to require PR reviews. | <pre>object({<br>    dismissal_teams                 = list(string)<br>    dismissal_users                 = list(string)<br>    dismiss_stale_reviews           = bool<br>    require_code_owner_reviews      = bool<br>    required_approving_review_count = number<br>  })</pre> | n/a | yes |
            | <a name="input_restrictions"></a> [restrictions](#input\_restrictions) | Branch protection,require restrictions (is only available for organization-owned repositories). | <pre>object({<br>    teams = list(string)<br>    users = list(string)<br>    apps  = list(string)<br>  })</pre> | n/a | yes |
            | <a name="input_status_checks_contexts"></a> [status\_checks\_contexts](#input\_status\_checks\_contexts) | Contexts for the status\_checks branch protection | `list(string)` | `[]` | no |
            | <a name="input_template_files"></a> [template\_files](#input\_template\_files) | List of the paths of the files that will be added in the new repo | `list(string)` | `[]` | no |
            | <a name="input_template_files_prefix"></a> [template\_files\_prefix](#input\_template\_files\_prefix) | Prefix of the file path to be removed in the new repo | `string` | `""` | no |
            | <a name="input_visibility"></a> [visibility](#input\_visibility) | Visibility of the repository | `string` | `"private"` | no |
            ## Outputs
            
            | Name | Description |
            |------|-------------|
            | <a name="output_repository_name"></a> [repository\_name](#output\_repository\_name) | n/a |
            ## Resources
            
            - resource.github_branch.template_files (main.tf#53)
            - resource.github_branch_default.main (main.tf#9)
            - resource.github_branch_protection_v3.main (main.tf#14)
            - resource.github_repository.repo (main.tf#1)
            - resource.github_repository_file.template_files (main.tf#60)
            - resource.github_repository_pull_request.template_files (main.tf#76)
            <!-- END_TF_DOCS -->
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../examples/complete/main.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            module "repository" {
              source      = "../../"
              name        = var.name
              description = var.description
              #checkov:skip=CKV_GIT_1: The repository must be public
              visibility            = var.visibility
              template_files        = var.template_files
              template_files_prefix = var.template_files_prefix
              #checkov:skip=CKV_GIT_5: Only one approving reviews for PRs
              required_pull_request_reviews = var.required_pull_request_reviews
              restrictions                  = var.restrictions
              status_checks_contexts        = var.status_checks_contexts
            }
        EOT
      + file                = "examples/complete/main.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../examples/complete/outputs.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            output "repository_name" {
              value = module.repository.repository_name
            }
        EOT
      + file                = "examples/complete/outputs.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../examples/complete/providers.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            provider "github" {
              owner = "flufi-io"
            }
        EOT
      + file                = "examples/complete/providers.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../examples/complete/terraform.tfvars"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name        = "testing-template-repository-jkshdbjk"
            visibility  = "public"
            description = "testing template repository"
            template_files = [
              "../../.config/.terraform-docs.yml",
            
              "../../.github/workflows/tfsec.yml",
              "../../.github/workflows/terrascan.yml",
              "../../.gitignore",
              "../../main.tf",
              "../../variables.tf",
              "../../versions.tf",
              "../../outputs.tf",
              "../../README.md",
            
              "../../examples/complete/main.tf",
              "../../examples/complete/variables.tf",
              "../../examples/complete/versions.tf",
              "../../examples/complete/outputs.tf",
              "../../examples/complete/terraform.tfvars",
              "../../examples/complete/providers.tf",
            
              "../../tests/complete/complete_test.go",
            ]
            template_files_prefix = "../../"
            
            restrictions = {
              teams = ["@flufi-io/devops-engineers"]
              users = ["pipo-flufi"]
              apps  = []
            }
            required_pull_request_reviews = {
              dismissal_teams                 = ["@flufi-io/devops-engineers"]
              dismissal_users                 = ["pipo-flufi"]
              dismiss_stale_reviews           = true
              require_code_owner_reviews      = true
              required_approving_review_count = 1
            }
            status_checks_contexts = ["terratest"]
        EOT
      + file                = "examples/complete/terraform.tfvars"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../examples/complete/variables.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            variable "name" {
              type        = string
              description = "Name of the repository"
            }
            variable "description" {
              type        = string
              description = "Description of the repository"
            }
            variable "visibility" {
              type        = string
              description = "Visibility of the repository"
              default     = "private"
            }
            
            
            variable "template_files" {
              type        = list(string)
              description = "List of the paths of the files that will be added in the new repo"
              default     = []
            }
            variable "template_files_prefix" {
              type        = string
              default     = ""
              description = "Prefix of the file path to be removed in the new repo"
            }
            variable "status_checks_contexts" {
              default     = []
              type        = list(string)
              description = "Contexts for the status_checks branch protection"
            }
            variable "required_pull_request_reviews" {
              type = object({
                dismissal_teams                 = list(string)
                dismissal_users                 = list(string)
                dismiss_stale_reviews           = bool
                require_code_owner_reviews      = bool
                required_approving_review_count = number
              })
              description = "Branch protection options to require PR reviews."
            }
            variable "restrictions" {
              type = object({
                teams = list(string)
                users = list(string)
                apps  = list(string)
              })
              description = "Branch protection,require restrictions (is only available for organization-owned repositories)."
            }
        EOT
      + file                = "examples/complete/variables.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../examples/complete/versions.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            terraform {
              required_providers {
                github = {
                  source  = "integrations/github"
                  version = ">=4.25.0"
                }
              }
            }
        EOT
      + file                = "examples/complete/versions.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../main.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            resource "github_repository" "repo" {
              name                 = var.name
              description          = var.description
              visibility           = var.visibility
              auto_init            = true
              vulnerability_alerts = true
            }
            
            resource "github_branch_default" "main" {
              repository = github_repository.repo.name
              branch     = "main"
            }
            
            resource "github_branch_protection_v3" "main" {
              depends_on                      = [github_repository.repo, github_branch_default.main]
              count                           = var.enable_branch_protection ? 1 : 0
              repository                      = github_repository.repo.name
              branch                          = github_branch_default.main.branch
              enforce_admins                  = true
              require_signed_commits          = true
              require_conversation_resolution = true
            
              dynamic "required_status_checks" {
                for_each = length(var.status_checks_contexts) == 0 ? toset([]) : toset([1])
                content {
                  strict   = true
                  contexts = var.status_checks_contexts
                }
              }
            
              dynamic "required_pull_request_reviews" {
                for_each = length(var.required_pull_request_reviews) == 0 ? toset([]) : toset([1])
                content {
                  dismiss_stale_reviews           = var.required_pull_request_reviews.dismiss_stale_reviews
                  require_code_owner_reviews      = var.required_pull_request_reviews.require_code_owner_reviews
                  required_approving_review_count = var.required_pull_request_reviews.required_approving_review_count
                  dismissal_teams                 = var.required_pull_request_reviews.dismissal_teams
                  dismissal_users                 = var.required_pull_request_reviews.dismissal_users
                }
              }
            
              dynamic "restrictions" {
                for_each = length(var.restrictions) == 0 ? toset([]) : toset([1])
                content {
                  users = var.restrictions.users
                  teams = var.restrictions.teams
                  apps  = var.restrictions.apps
                }
              }
            }
            
            
            resource "github_branch" "template_files" {
              depends_on = [github_repository.repo, github_branch_default.main, github_branch_protection_v3.main]
              count      = length(var.template_files) == 0 ? 0 : 1
              repository = github_repository.repo.name
              branch     = "template_files"
            }
            
            resource "github_repository_file" "template_files" {
              depends_on = [
                github_repository.repo,
                github_branch_default.main,
                github_branch_protection_v3.main,
                github_branch.template_files
              ]
              for_each            = length(var.template_files) == 0 ? toset([]) : toset(var.template_files)
              repository          = github_repository.repo.name
              branch              = github_branch.template_files[0].branch
              file                = trimprefix(each.value, var.template_files_prefix)
              content             = file(each.value)
              commit_message      = "Managed by Terraform"
              overwrite_on_create = true
            }
            
            resource "github_repository_pull_request" "template_files" {
              depends_on = [
                github_repository.repo,
                github_branch_default.main,
                github_branch_protection_v3.main,
                github_branch.template_files,
                github_repository_file.template_files
              ]
              count           = length(var.template_files) == 0 ? 0 : 1
              base_repository = github_repository.repo.name
              base_ref        = github_branch_default.main.branch
              head_ref        = github_branch.template_files[0].branch
              title           = "Added Template Files"
              body            = "Merge this PR"
            }
        EOT
      + file                = "main.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../outputs.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            output "repository_name" {
              value = github_repository.repo.name
            }
        EOT
      + file                = "outputs.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../tests/complete/complete_test.go"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            package test
            
            import (
            	"github.com/joho/godotenv"
            	"log"
            	"os"
            	"strconv"
            	"testing"
            	"time"
            
            	"github.com/gruntwork-io/terratest/modules/terraform"
            	"github.com/stretchr/testify/assert"
            )
            
            func TestCompleteExample(t *testing.T) {
            	godotenv.Load("../../.env")
            	// DELAY is the time in seconds to run terraform destroy after terraform apply
            	DELAY, _ := strconv.Atoi(os.Getenv("DELAY"))
            	varFiles := []string{"../../examples/complete/terraform.tfvars"}
            	terraformOptions := terraform.WithDefaultRetryableErrors(t, &terraform.Options{
            		TerraformDir: "../../examples/complete",
            		VarFiles:     varFiles,
            		Vars:         map[string]interface{}{},
            		Upgrade:      true,
            		Reconfigure:  true,
            	})
            
            	defer terraform.Destroy(t, terraformOptions)
            	// Delay the execution of the terraform destroy
            	defer func() {
            		delay(DELAY)
            	}()
            
            	terraform.InitAndApply(t, terraformOptions)
            
            	output := terraform.Output(t, terraformOptions, "repository_name")
            	assert.Equal(t, "testing-template-repository-jkshdbjk", output)
            }
            
            func delay(seconds int) {
            	for {
            		if seconds <= 0 {
            			break
            		} else {
            			log.Println(seconds)
            			time.Sleep(1 * time.Second)
            			seconds--
            		}
            	}
            }
        EOT
      + file                = "tests/complete/complete_test.go"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../variables.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            variable "name" {
              type        = string
              description = "Name of the repository"
            }
            variable "description" {
              type        = string
              description = "Description of the repository"
            }
            
            variable "visibility" {
              type        = string
              description = "Visibility of the repository"
              default     = "private"
            }
            
            variable "enable_branch_protection" {
              type        = bool
              description = "Enable the branch protection for the default(main) branch"
              default     = true
            }
            
            variable "template_files" {
              type        = list(string)
              description = "List of the paths of the files that will be added in the new repo"
              default     = []
            }
            variable "template_files_prefix" {
              type        = string
              default     = ""
              description = "Prefix of the file path to be removed in the new repo"
            }
            
            variable "status_checks_contexts" {
              default     = []
              type        = list(string)
              description = "Contexts for the status_checks branch protection"
            }
            variable "required_pull_request_reviews" {
              type = object({
                dismissal_teams                 = list(string)
                dismissal_users                 = list(string)
                dismiss_stale_reviews           = bool
                require_code_owner_reviews      = bool
                required_approving_review_count = number
              })
              description = "Branch protection options to require PR reviews."
            }
            variable "restrictions" {
              type = object({
                teams = list(string)
                users = list(string)
                apps  = list(string)
              })
              description = "Branch protection,require restrictions (is only available for organization-owned repositories)."
            }
        EOT
      + file                = "variables.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_file.template_files["../../versions.tf"] will be created
  + resource "github_repository_file" "template_files" {
      + branch              = "template_files"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            terraform {
              required_providers {
                github = {
                  source  = "integrations/github"
                  version = ">=4.25.0"
                }
              }
            }
        EOT
      + file                = "versions.tf"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "testing-template-repository-jkshdbjk"
      + sha                 = (known after apply)
    }

  # module.repository.github_repository_pull_request.template_files[0] will be created
  + resource "github_repository_pull_request" "template_files" {
      + base_ref              = "main"
      + base_repository       = "testing-template-repository-jkshdbjk"
      + base_sha              = (known after apply)
      + body                  = "Merge this PR"
      + draft                 = (known after apply)
      + head_ref              = "template_files"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "Added Template Files"
      + updated_at            = (known after apply)
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + repository_name = "testing-template-repository-jkshdbjk"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @pipo-flufi, Action: `pull_request`, Working Directory: ``, Workflow: `terraform validate`*